app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ('test item number 3', 'this is the body for the test item num 3', '2011-09-10 15:39:33.779094', '2011-09-10 15:39:33.779094')
---
  def create
    @article = Article.new(params[:article])
    flash[:message] = "Article '#{@article.title}' was created."
    @article.save!

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 5 LIMIT 1
UPDATE "articles" SET "title" = 'test 6 edit', "body" = 'test 6 edit body test', "updated_at" = '2011-09-10 20:32:44.293115' WHERE "articles"."id" = 5
---
  def update
    @article = Article.find(params[:id])
    @article.update_attributes(params[:article])