app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "author_name", "author_email", "author_url", "body", "created_at", "updated_at") VALUES (NULL, NULL, NULL, NULL, NULL, '2011-09-11 12:06:41.140457', '2011-09-11 12:06:41.140457')
---
  def create
    @comment = Comment.new(params[:comment])
    flash[:message] = "Comment '#{@comment.author_name}' was created."
    @comment.save!